import React from "react";
import { FaShoppingBag, FaCalendarTimes } from "react-icons/fa";
import "./ProjectStory.scss";

function ProjectStory() {
  const projectIntro =
    "속에서 붙잡아 가는 부패를 운다. 심장의 용감하고 어디 가슴이 것이다. 용감하고 얼마나 발휘하기 것이다. 뭇 심장은 내려온 인생을 황금시대다. 할지라도 이 예가 트고, 끓는 할지니, 인생을 인류의 어디 이것이다. 구하지 긴지라 공자는 철환하였는가? 것이다.보라, 때에, 인간이 있는가? 얼음이 이는 들어 사랑의 앞이 동산에는 얼음과 철환하였는가? 커다란 주는 예가 노래하며 인간이 밥을 그리하였는가? 수 생생하며, 이성은 지혜는 품었기 아름답고 위하여서. 있으며, 청춘 피부가 눈이 인도하겠다는 발휘하기 거친 봄바람이다.\n\n많이 풀밭에 인생에 인류의 그들에게 그러므로 풍부하게 귀는 가슴이 봄바람이다. 심장의 방지하는 긴지라 무엇을 구하지 끓는다. 그와 그들은 대한 가치를 만천하의 사람은 유소년에게서 용감하고 곧 듣는다. 따뜻한 미묘한 곳이 것이다. 풀밭에 그러므로 작고 우는 위하여서. 풀이 꽃이 이것이야말로 봄날의 부패뿐이다. 갑 앞이 끓는 같으며, 풀이 피어나는 같지 위하여 천지는 피다. 끓는 커다란 장식하는 있는가? 그들의 사랑의 인생을 기관과 보는 별과 할지라도 그러므로 아름답고 황금시대다. 구할 그림자는 청춘의 커다란 사랑의 눈이 설산에서 소리다.이것은 봄날의 있으랴? 길을 얼음에 것은 이성은 생명을 안고, 눈에 청춘에서만 봄바람이다.\n\n그들의 만천하의 속에서 그림자는 이것이다. 너의 가는 품고 사라지지 목숨이 황금시대를 부패뿐이다. 품고 싶이 천지는 밥을 광야에서 것이다. 위하여서 내는 보이는 이상의 주는 하였으며, 곳으로 쓸쓸하랴? 사라지지 열매를 많이 인류의 하였으며, 것이다. 이상이 청춘의 인생에 것이다. 무엇을 크고 이상 꽃이 보이는 인생의 아니더면, 듣는다. 설레는 우리의 있는 길을 심장은 날카로우나 피가 것이다. 없으면 위하여, 현저하게 청춘의 무한한 천고에 부패뿐이다. 만천하의 있음으로써 구하지 싸인 남는 인류의 어디 거선의 위하여서. 끓는 힘차게 무엇을 유소년에게서 거친 거선의 소담스러운 품으며, 어디 것이다.";
  const projectBudget =
    "흙으로 언덕 나는 계십니다. 것은 둘 않은 다 별 그리워 봅니다. 이름과, 못 하나에 사랑과 추억과 멀리 봅니다. 마디씩 경, 가을로 위에도 이 오면 버리었습니다. 밤이 별 가슴속에 밤을 하늘에는 묻힌 이름자 이름을 거외다.\n\n내일 마리아 된 오면 봅니다. 아스라히 프랑시스 다 하늘에는 별이 이국 어머님, 까닭입니다. 이름자 패, 이름과, 옥 별 시와 버리었습니다. 이런 별 벌써 패, 쉬이 그러나 하나 까닭입니다. 못 불러 속의 계십니다. 벌써 벌레는 같이 사람들의 피어나듯이 하나에 버리었습니다. 별 책상을 밤을 이런 잠, 어머님, 다 거외다.";
  const projectPlan =
    "타오르고 품었기 천고에 끓는 이상의 웅대한 사막이다. 석가는 사라지지 품으며, 인간의 쓸쓸하랴? 반짝이는 같이, 이상이 피고, 것이다. 대한 관현악이며, 예수는 얼마나 이상 밥을 풍부하게 끓는다. 더운지라 너의 우리는 노래하며 봄바람을 귀는 그림자는 사막이다. 얼마나 인간의 무한한 긴지라 끝까지 청춘이 청춘의 것이다. 무한한 안고, 예수는 사랑의 구하지 황금시대다. 속에서 붙잡아 가지에 이상 못하다 피다. 영원히 따뜻한 남는 과실이 사랑의 평화스러운 품었기 이것을 품으며, 보라.";
  const projectTeam =
    "가득 된 불러 부끄러운 멀리 까닭입니다. 별빛이 애기 별이 책상을 덮어 위에 봅니다.";
  const projectExplain =
    "불러 때 프랑시스 아스라히 아무 오는 아이들의 까닭입니다. 계집애들의 가을로 다하지 까닭이요, 이름을 나는 걱정도 별 있습니다. 패, 겨울이 나는 까닭이요, 별 지나고 내일 하나에 그리워 계십니다. 아이들의 내일 가득 동경과 아침이 때 멀리 무성할 강아지, 까닭입니다. 하나에 사람들의 별 부끄러운 헤일 청춘이 봅니다. 가슴속에 옥 쉬이 노새, 새겨지는 겨울이 별 있습니다. 이런 다하지 별 지나가는 비둘기, 까닭이요, 어머니 까닭입니다. 오면 별빛이 가득 별들을 있습니다. 속의 내 헤일 하나의 봅니다. 내일 겨울이 토끼, 않은 많은 봅니다. 북간도에 남은 이네들은 까닭이요, 마리아 우는 노새, 토끼, 않은 계십니다.\n\n내린 언덕 오는 한 별 까닭입니다. 보고, 가득 청춘이 토끼, 지나가는 내일 위에도 듯합니다. 별 소학교 무엇인지 언덕 위에도 계십니다. 내린 벌레는 된 하나의 자랑처럼 봅니다. 나는 청춘이 가을로 계집애들의 가을 계십니다. 이름과 책상을 흙으로 하나에 라이너 거외다. 소녀들의 풀이 멀리 내 까닭입니다. 불러 피어나듯이 무덤 하나에 책상을 있습니다. 아침이 하나 같이 별이 까닭입니다. 아이들의 새겨지는 언덕 마디씩 이름과 무성할 경, 릴케 위에 봅니다.";
  const projectPolicy =
    "배송이 필요한 선물\n- 프로젝트 마감일 후에는 즉시 제작에 착수하는 프로젝트 특성상, 단순 변심에 의한 후원금 환불이 불가능합니다.\n- 파손 또는 불량품 수령 시 7일 이내로 교환이 가능합니다.\n- 교환 및 AS 문의는 '창작자에게 문의하기'로 신청해 주세요.\n- 파손이나 불량품 교환 시 발생하는 비용은 창작자가 부담합니다. 선물 확인을 위한 포장 훼손 외에 아이템의 가치가 훼손된 경우에는 교환 및 환불이 불가합니다.\n- 후원자가 배송지를 잘못 기재하거나 창작자에게 사전 고지 없이 배송지를 수정하여 배송사고가 발생할 경우 창작자는 최대 1번까지 재발송 해 드립니다. 배송비 부담은 후원자 에게 있습니다.\n- 예상 전달일로부터 30 일 이상 선물 전달이 이뤄지지 않을 경우, 환불을 원하시는 분들께는 수수료를 포함한 후원금을 환불해 드립니다.";

  return (
    <section className="ProjectStory">
      <h3 className="ProjectArticleHead">프로젝트 소개</h3>
      {projectIntro.split("\n").map((line) => (
        <>
          {line}
          <br />
        </>
      ))}
      <hr className="ProjectBodyHr" />
      <h3 className="ProjectArticleHead">프로젝트 예산</h3>
      {projectBudget.split("\n").map((line) => (
        <>
          {line}
          <br />
        </>
      ))}
      <hr className="ProjectBodyHr" />
      <h3 className="ProjectArticleHead">프로젝트 일정</h3>
      {projectPlan.split("\n").map((line) => (
        <>
          {line}
          <br />
        </>
      ))}
      <hr className="ProjectBodyHr" />
      <h3 className="ProjectArticleHead">프로젝트 팀 소개</h3>
      {projectTeam.split("\n").map((line) => (
        <>
          {line}
          <br />
        </>
      ))}
      <hr className="ProjectBodyHr" />
      <h3 className="ProjectArticleHead">선물 설명</h3>
      {projectExplain.split("\n").map((line) => (
        <>
          {line}
          <br />
        </>
      ))}
      <hr className="ProjectBodyHr" />
      <h3 className="ProjectArticleHead">신뢰와 안전</h3>
      <article className="ProjectArticleContent">
        <h4 className="ProjectArticleSubhead">크라우드 펀딩에 대한 안내</h4>
        <h5>
          <FaShoppingBag className="ProjectArticleIcon" />
          후원은 구매가 아닌 창의적인 계획에 자금을 지원하는 일입니다.
        </h5>
        <p>
          전자상거래법상 통신판매는 소비자의 청약 전 규격, 제조연월일 등
          구체적인 상품정보가 제공 가능한 것을 대상으로 합니다. 따라서
          텀블벅에서의 후원은 통신판매에 해당하지 않고, 전자상거래법 및
          소비자보호규정(수령 후 7일 내 청약철회 등)이 적용되지 않습니다.
        </p>
        <h5>
          <FaCalendarTimes className="ProjectArticleIcon" />
          프로젝트는 계획과 달리 진행될 수 있습니다.
        </h5>
        <p>
          예상을 뛰어넘는 멋진 결과가 나올 수 있지만 진행 과정에서 계획이 지연,
          변경되거나 무산될 수도 있습니다. 본 프로젝트를 완수할 책임과 권리는
          창작자에게 있습니다.
        </p>
        <hr className="ProjectBodyHr" />
        <h4 className="ProjectArticleSubhead">프로젝트 정책</h4>
        {projectPolicy.split("\n").map((line) => (
          <>
            {line}
            <br />
          </>
        ))}
        <hr className="ProjectBodyHr" />
        <h4 className="ProjectArticleSubhead">예상되는 어려움</h4>
        <hr className="ProjectBodyHr" />
      </article>
    </section>
  );
}

export default ProjectStory;
